emacs/init.org
** General Keybindings
A keybinding framework to set keybindings easily.

We use general because it gives:
- a convenient method for binding keys.
- easy leader key integration.
- good evil-mode and which-key support.
- a consistent and unified interface for managing keybinds.
And it is also really customizable.
#+begin_src emacs-lisp
    (use-package general
      :config
      (general-evil-setup) ;; <- evil
      ;; Set up 'C-SPC' as the leader key
      (general-create-definer mark/leader-keys
        :states '(normal insert visual motion emacs) ;; <- evil
        :keymaps 'override
        :prefix "SPC"
        :global-prefix "C-SPC") ;; Set global leader key so we can access our keybindings from any state

      (mark/leader-keys
        "." '(find-file :wk "Find file")
        "TAB" '(comment-line :wk "Comment lines")
        "q" '(flymake-show-buffer-diagnostics :wk "Flymake buffer diagnostic")
        "u" '(undo-tree-visualize :wk "Undotree")

    	;; Harpoon
        "a" '(harpoon-toggle-quick-menu :wk "Harpoon toggle menu")
        "h" '(harpoon-go-to-1 :wk "Harpoon select 1")
        "j" '(harpoon-go-to-2 :wk "Harpoon select 2")
        "k" '(harpoon-go-to-3 :wk "Harpoon select 3")
        "l" '(harpoon-go-to-4 :wk "Harpoon select 4")

        "p" '(projectile-command-map :wk "Projectile")
        "s p" '(projectile-discover-projects-in-search-path :wk "Search for projects"))

      (mark/leader-keys
        "m" '(:ignore t :wk "Harpoon") ;; To get more help use C-h commands (describe variable, function, etc.)
        "m a" '(harpoon-add-file :wk "Harpoon add")
        "m f" '(harpoon-toggle-file :wk "harpoon-toggle-file")
        "m c" '(harpoon-clear :wk "Harpoon Clear")
        "m p" '(harpoon-go-to-prev :wk "Harpoon previus")
        "m n" '(harpoon-go-to-next :wk "Harpoon next"))

      (mark/leader-keys
        "s" '(:ignore t :wk "Search")
        "s c" '((lambda () (interactive) (find-file "~/.config/emacs/init.org")) :wk "Find emacs Config")
        "s r" '(consult-recent-file :wk "Search recent files")
        "s f" '(consult-fd :wk "Search files with fd")
        "s g" '(consult-ripgrep :wk "Search with ripgrep")
        "s l" '(consult-line :wk "Search line")
        "s i" '(consult-imenu :wk "Search Imenu buffer locations")
    	"s e"' (sudo-edit :wk "Root edit current file")
    	"s u"' (sudo-edit-find-file :wk "Root find file"))

      (mark/leader-keys
        "d" '(:ignore t :wk "Buffers & Dired")
        "d s" '(consult-buffer :wk "Switch buffer")
        "d k" '(kill-current-buffer :wk "Kill current buffer")
        "d i" '(ibuffer :wk "Ibuffer")
        "d n" '(next-buffer :wk "Next buffer")
        "d p" '(previous-buffer :wk "Previous buffer")
        "d r" '(revert-buffer :wk "Reload buffer")
        "d v" '(dired :wk "Open dired")
        "d j" '(dired-jump :wk "Dired jump to current")
    	"d a" '(consult-dir :wk "Consult dir"))

      (mark/leader-keys
        "e" '(:ignore t :wk "Languages")
        "e e" '(eglot-reconnect :wk "Eglot Reconnect")
        "e d" '(eldoc-doc-buffer :wk "Eldoc Buffer")
        "e f" '(eglot-format :wk "Eglot Format")
        "e l" '(consult-flymake :wk "Consult Flymake")
        "e r" '(eglot-rename :wk "Eglot Rename")
        "e i" '(xref-find-definitions :wk "Find definition")
        "e v" '(:ignore t :wk "Elisp")
        "e v b" '(eval-buffer :wk "Evaluate elisp in buffer")
        "e v r" '(eval-region :wk "Evaluate elisp in region"))

      (mark/leader-keys
        "g" '(:ignore t :wk "Git")
        "g s" '(magit-status :wk "Magit status"))

      (mark/leader-keys
        "r" '(:ignore t :wk "Reload") ;; To get more help use C-h commands (describe variable, function, etc.)
        "r q" '(save-buffers-kill-emacs :wk "Quit Emacs and Daemon")
        "r r" '((lambda () (interactive)
                  (load-file "~/.config/emacs/init.el"))
                :wk "Reload Emacs config"))

      (mark/leader-keys
    	"v" '(:ignore t :wk "Vterm")
    	"v m" '(multi-vterm :wk "New Multi Vterm")
    	"v n" '(multi-vterm-next :wk "Vterm next")
    	"v p" '(multi-vterm-prev :wk "Vterm previus")
    	"v d" '(multi-vterm-dedicated-toggle :wk "Toggle dedicated Vterm"))

      (mark/leader-keys
        "t" '(:ignore t :wk "Toggle")
        "t t" '(visual-line-mode :wk "Toggle truncated lines (wrap)")
        "t l" '(display-line-numbers-mode :wk "Toggle line numbers")
    	"t m" '(evil-mc-mode :wk "Evil mc mode"))
      )

    ;; Fix general.el leader key not working instantly in messages buffer with evil mode
    (use-package emacs
      :ghook ('after-init-hook
              (lambda (&rest _)
                (when-let ((messages-buffer (get-buffer "*Messages*")))
                  (with-current-buffer messages-buffer
                    (evil-normalize-keymaps))))
              nil nil t)
      )
#+end_src

* Appearance
** Set Theme
Set gruvbox theme, if you want some themes try out doom-themes.
Use consult-theme to easily try out themes (*Epilepsy* Warning).
#+begin_src emacs-lisp
    (use-package gruvbox-theme
      :config
      (setq gruvbox-bold-constructs t)
      (load-theme 'gruvbox-dark-medium t)) ;; We need to add t to trust this package
#+end_src

** Transparency
With Emacs version 29, true transparency has been added.
#+begin_src emacs-lisp
    (add-to-list 'default-frame-alist '(alpha-background . 90)) ;; For all new frames henceforth
#+end_src

** Setting Fonts
#+begin_src emacs-lisp
    (set-face-attribute 'default nil
                        :font "JetBrains Mono" ;; Set your favorite type of font or download JetBrains Mono
                        :height 120
                        :weight 'medium)
    ;; This sets the default font on all graphical frames created after restarting Emacs.
    ;; Does the same thing as 'set-face-attribute default' above, but emacsclient fonts
    ;; are not right unless I also add this method of setting the default font.

    (add-to-list 'default-frame-alist '(font . "JetBrains Mono")) ;; Set your favorite font
    (setq-default line-spacing 0.12)
#+end_src

** Doom Modeline
A fancy, fast and customizable mode-line.
#+begin_src emacs-lisp
    (use-package doom-modeline
      :custom
      (doom-modeline-height 25) ;; Set modeline height
      :hook (after-init . doom-modeline-mode))
#+end_src

** Nerd Icons
This is an icon set that can be used with dired, ibuffer and other Emacs packages.
Don't forget nerd-icons-install-fonts to install the resource fonts.

We use nerd-icons because it supports both GUI and TUI unlike all-the-icons.
Also Doom modeline requires nerd icons.
#+begin_src emacs-lisp
    (use-package nerd-icons
      :if (display-graphic-p))

    (use-package nerd-icons-dired
      :hook (dired-mode . (lambda () (nerd-icons-dired-mode t))))

    (use-package nerd-icons-ibuffer
      :hook (ibuffer-mode . nerd-icons-ibuffer-mode))
#+end_src

* Development
** Projectile
Project interaction library for Emacs.

Emacs has a built in project manager called project.el, but we don't use it.
You can try it out with the keybinds under C-x p because project.el does not require any special setup to use.

We use projectile because it:
- supports more features and project types.
- has better integration with projects.
- has better documentation.
- is developed faster.
More [[https://docs.projectile.mx/projectile/projectile_vs_project.html][reasons]] to use projectile.
#+begin_src emacs-lisp
    (use-package projectile
      :config
      (projectile-mode)
      :custom
      (projectile-auto-discover nil) ;; Disable auto search for better startup times ;; Search with a keybind
      (projectile-run-use-comint-mode t) ;; Interactive run dialog when running projects inside emacs (like giving input)
      (projectile-switch-project-action #'projectile-dired) ;; Open dired when switching to a project
      (projectile-project-search-path '(("/mnt/Ext4D/Mark/Projektek/" . 2)
                                        ("/mnt/Ext4D/Mark/Projektek/Desktop/Gyakorlas/" . 2)
    									)))
#+end_src

